
#============================================================================
# 1 連續數字 
#============================================================================
'''
sum = [i + j for i in range(1, 4) for j in range(10, 14)]
print(sum)

''' 
#============================================================================
#2 有條件 for loop concise  
#============================================================================
'''
sum =[i*j for i in range(1,3) if i==2 for j in range(10,20 ) if j==10 ]


print(sum)
''' 
#============================================================================
#3 字串相乘 https://ithelp.ithome.com.tw/articles/10214161 
#============================================================================
#笨方法 
'''
s=""
s=[s+"hello " for i in range(1,5) ]
print(str(s))
'''
# python  快速方法 
''' 
s="hello "
s=s*5
print(s) 
''' 

#============================================================================
# 4 星星塔  https://ithelp.ithome.com.tw/articles/10214161
#============================================================================
# o(n^2) 
'''
for i in range(1,10):
    for j in range(1,i):
        print("*",end="")
    print("")
''' 
#o(n) 
'''
for i in range(1,10):
    print("*"*i)
''' 
#============================================================================
# 5 金字塔 https://ithelp.ithome.com.tw/articles/10214161
#============================================================================
'''
for i in range(0,10):
    print(" "*(10-i)+"*"*(2*i-1))
'''

#============================================================================
# 6 菱形星星 https://ithelp.ithome.com.tw/articles/10214161
#============================================================================
 
'''
for i in range(1,8):
    print(' ' * (7-i) + '*' * (2*i-1))
for i in reversed(range(1,7)):
    print(' ' * (7-i) + '*' * (2*i-1))
    

'''
#============================================================================
# 7 密碼＊hide 
#============================================================================
'''
def hidePassword(psd):
    return '*'*len(psd)
pd=input("psd=")
print("密碼:"+hidePassword(pd))
''' 

#============================================================================
# 8 lamda function practice 兩字串相加＆比大小 
#============================================================================
'''
add=lambda x,y : x+y 
print(add("hello","world "))

min= lambda x,y: y if x>y  else x 

print(min(66,666)) 
''' 
#============================================================================
# 9  list practice  https://medium.com/ccclub/ccclub-python-for-beginners-tutorial-c15425c12009
# insert a list to another directlt will seem whole list as a factor  rather than a list 
#==============================================================================
'''
list= [i for i in  range(1,10)]
listB=[i for i in range(10,20)]

list.insert(2,listB)

print(list )
''' 


#suing a extend function  but it can onlt add in tail not anyplace you want 
'''
list =[i for i in range(1,10)]
listB=[i for i in range(10,20)] 

list.extend(listB)
print(list) 
''' 


#==============================================================================
#10 input practice 
#==============================================================================

'''
b=int(input("give me a number")) 
print(b)
''' 
#==============================================================================
#11 取更精確數字 
#==============================================================================
'''
import decimal 
print(10/3)
print(decimal.Decimal(10/3))
'''

#==============================================================================
#12 運算子
#==============================================================================
'''
a=10 
b=2
c=0  

print(a+b)
c+=b 
print(c) 
a/=b
print(a)
a*=b 
print(a )

a**=b
print(a )
''' 
#==============================================================================
#13 concise description in  if else  
#==============================================================================
'''
score = eval(input("give me a number ")) 

print("adimition "if score >60 else "rejection ")
'''
#==============================================================================
# 14 參數格式  format 
#==============================================================================
''' 
x=2
y=2

print("{0:30d}{1:15d}".format(x,y) )
''' 
'''
a= eval(input("enter a number  ")) 

print("{0}{1:10d}".format(a,a*100))
''' 
#==============================================================================
# 15 while loop 
#==============================================================================
'''
count=0 

while count<10 : 
    print(count)
    count +=1 
print("done ")
'''

''' 
#  count set -1 
count=-1
number=0
while number!=-1 :
    number=eval(input("enter a number "))
    
    count+=1 
print(count) 

''' 
''' 
sum =score= 0 
count = -1 
while score!= -1 : 
    score= eval(input("enter a number ")) 
    sum+=score 
    count+=1 
    
print(count )
print(sum )
''' 
 #==============================================================================
# format expretion with string 
'''
a=eval(input())
b=eval(input()) 
print("first={0:2d}  second={1:15d}".format(a,b))
''' 
#==============================================================================
# 16 lsit addtion 
#==============================================================================
'''
a=[1,2]
b=[2,4] 
print(a+b)
''' 
#==============================================================================
# 17 計算字元出現的位置和次數 
#==============================================================================

'''
word="hello word " 
print(word.index("h") )
print(word.count('l') )
''' 
#==============================================================================
#  18 每隔n個字元提取字元 
#==============================================================================
''' 
word="hello world "
for i in range(0,len(word),2): 
    print("{0:2d}".format(i)) 
''' 
#==============================================================================
# 19   what is slicing 
#==============================================================================
''' 
#   due to list and string has order ,you can using index to choose what you want 
list=[1,2,3,4,5]
print(list[2:])

word="hello wolrd" 
print(word[2:])
''' 
#============================================================================== 
# 20 反轉lsit or string  and 反轉間隔取list 
#============================================================================== 

''' 
list=[i for i in range(1,10)if i%2==0] 
print(list[::-1])

print(list[::-2])
''' 
#============================================================================== 
# 21 取3-10 factor than reverse 
#============================================================================== 
'''
list=[3,10,-4,7,6,-4,1,-2,0,10,3,7 ]
list=list[3:10]
list=list[::-1]
print(list)

''' 
#==============================================================================  
#22 find function 取指n個 char 
#==============================================================================  
'''
word="NIU CS is the best "
a=word.find("t")
b=word.find("t",a+1)
print(b)
print(a)
''' 
#==============================================================================  
# 23建立一個two dimetion matrix in python 
#==============================================================================  
'''
list=[[1,2,3],[4,5,6]] 
print(list[0][1])
''' 
#==============================================================================  
# 24using format output two number 
#==============================================================================  
'''
a =5
b=6
print("first={},second={}".format(a,b)) 
''' 
#==============================================================================  
#25 using join function to connect  string 
#==============================================================================  

'''
str=""
word=["a","b","c"]
print(str.join(word))
print("&".join(word))
''' 
#==============================================================================  
#26  construct a  double matrix  
#==============================================================================  
'''

list=[]
print("first row enter ")
for i in range(0,3):
    list.append([])
    for j in range(0,3):
        list[i].append(eval(input("give me a number "))) 
    print("第{0}列輸入開始".format(i+2))
for  i in range(len(list)):
    for j in range(len(list[i])):
        print("{0:2d}".format(list[i][j]),end=" ")
    print("")
''' 
#==============================================================================  
#27 串列的複製 和一班變數的copy的差別 哪個是call by referance or call by value 
#==============================================================================  

''' 

import copy 

print("#==============================================================================  ")
print("using shallow  copy  method=============================  ")
lista=[1,2,3,[3,4]] 
listb=copy.copy(lista )
print("list a=",lista)
print("listb=",listb) 
print("after change listb[1]=666...")
lista[2]=666
print("lista=",lista)
print("lsitb=",listb)
print(lista==listb)


'''
'''  
list =[1,2,3]
listb=list
listb[1]=666
print(list)
''' 
''' 
a =2 
b=a 
b=5 
print(a)
''' 

#==============================================================================  
# 28 用簡短for loop 產生二維串列 還有一般方式 
#==============================================================================  
'''
list_head=['A','B','C','D']#設定字母開頭list 當作四種花色
poker_set=[[x,y] for x in list_head for y in range(1,14) ] #產生52張隨機卡牌 含有4種花色之代表字母和1-13的數字
# 一開始不要直接存成字串 省去split的麻煩 直接把字串和整數點數分開儲存 等排序好了 再合成字串使用 
''' 

''' 
list=[ ]

for i in range(row_number):
    list.append([])
    for j in range(col_number):
        list[i].append(eval(input("enter factor number )))
''' 
#==============================================================================  
